// сертификат - последовательность состояний динамики, приводящая к ответу. Не совсем
//  строгое определение, конечно. Понятие сертификата зависит от задачи.
//   В задаче про жучка - это путь жучка с максимальной суммой. В задаче о размене
//    - минимальный набор монет, которым можно набрать заданную сумму. В задаче о рюкзаке
//     - набор предметов наибольшей суммарной стоимости, помещающийся в рюкзак.

// Динамическое программирование - однонаправленное. Если бы жук ходил во все стороны
// появились бы циклы, не должно быть циклов.
}