for (int i = 0, j = 0; j < n;)
{
    while (j < n && ...)
    {
        j++;
    }
    while (i <= j && ...)
    {
        i++;
    }
}

////////////////////////////////////////////////////////////////////////////////
Общий трафарет

int l = 0, r = 0;

while (r < n)
{
    while (r < n && отрезок хороший)
    {
        добавить a[r];
        r++;
    }

    while (отрезок плохой)
    {
        убрать a[l];
        l++;
    }
}

////////////////////////////////////////////////////////////////////////////////
l перебираем, r убегает

for (int l = 0, r = 0; l < n; ++l)
{
    while (r < n && отрезок хороший)
    {
        добавить a[r];
        r++;
    }

    убрать a[l];
}

////////////////////////////////////////////////////////////////////////////////
r перебираем, l догоняет

for (int l = 0, r = 0; r < n; ++r)
{
    добавить a[r];

    while (отрезок плохой)
    {
        убрать a[l];
        l++;
    }
}