DROP VIEW V_AvgTotal;

-- Она удалит представление V_AvgTotal. Из базы данных удаляется только пред-
-- ставление — синтаксис DROP VIEW не влияет на данные.

-- ПРИМЕЧАНИЕ
-- Если вы удалите представление, на которое ссылаются другие представле-
-- ния, эти представления больше не будут работать.

-- ВНИМАНИЕ
-- DROP — это команда для удаления любых элементов. Она может также уда-
-- лить из базы данных таблицу. В следующей главе вы изучите инструменты,
-- с помощью которых можно редактировать или удалять данные без воз-
-- можности восстановления. Как вы уже знаете, представление также можно
-- удалить из базы данных, щелкнув по нему правой кнопкой мыши и выбрав
-- опцию Remove View (Удалить представление).